Revit 2024 API
Document.LoadFamily Method (Document)
 Loads the contents of this family document into another document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public Family LoadFamily(
	Document targetDocument
)
Visual Basic
Public Function LoadFamily ( _
	targetDocument As Document _
) As Family
Visual C++
public:
Family^ LoadFamily(
	Document^ targetDocument
)
Parameters
targetDocument
Type: Autodesk.Revit.DB.Document
The target document where the family will be loaded.
Return Value
Reference of the family in the target document.
Remarks
If you are reloading an edited family back into the source document from which it was extracted, this method will always fail. This is because this method automatically suppresses the prompts Revit typically uses to deal with conflicts between families, and assumes that any such conflict should prevent the loading. If you want to be able to reload the same family into the source document, you should use the LoadFamily() overload accepting IFamilyLoadOptions.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  Thrown when the input argument-"targetDocument"-is null.
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown when the current document is not a family document, or when the target document is modifiable (e.g. there is an uncommitted transaction) or doesn't support load of this kind of families (e.g. loading a model family to detail family is disallowed), or when this family was found in the target document already and the conflict caused an automatic abort of the load operation, or when a shared family in this family was found in the target document already and the conflict caused an automatic abort of the load operation, or this document is currently in a read-only state.
Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException |  Thrown if this method is called during dynamic update.
See Also
Document Class
LoadFamily Overload
Autodesk.Revit.DB Namespace